from random import randint

comp = randint(1, 10)

print("Вітаю вас у грі угадай число!")
name = input("Як вас звати?")
print("Дуже приємно", name,", угадайте число яке загадав компютер в межах від 1 до 10. Удачі=)")
user = 0
tries = 3    #Вкажіть кількість спроб(на одну більше ніж потрібно)

while user != comp:
    tries = tries - 1
    print("У вас є така кількість спроб - ", tries+1,)

    user = int(input("Напишіть вашу відповідь"))
    if user > comp:
        print ("Ви не вгадали, компютер загадав менше число, спробуйте ще раз")
    if comp <= user <= comp:
        print("Вітаю ви вгадали")
        break
    if tries == 0:
        print("На жаль у вас закінчились спроби і ви програли, наступного зару вам пощастить=)")
        break
    else:
        print ("Ви не вгадали, компютер загадав більше число, спробуйте ще раз")


