from random import randint

x = 0
while x < 1:
    x = randint(1, 10)

print("OmegaLUL")
print("Lol")
print("Угадайте число яке загадав компютер від 1 до 10. У вас є дві спроби.")
a = int(input("Напишіть вашу відповідь"))


if x < a:
    print("На жаль ви програли. Компютер загадав менше число.Але у вас е ще один шанс=)")
    a = int(input("Напишіть ваш новий варіант"))

    if x < a:
        print("На жаль ви програли. Компютер загадав менше число. Але наступного разу вам обовязково пощастить=)")

    elif x <= a <= x:
        print("Ура ви перемогли!")

    else:
        print("На жаль ви програли. Компютер загадав більше число. Але наступного разу вам обовязково пощастить=)")


elif x <= a <= x:
    print("Ура ви вгадали!")


else:
    print("На жаль ви програли. Компютер загадав більше число. Але у вас е ще один шанс=)")
    a = int(input("Напишіть ваш новий варіант"))

    if x < a:
        print("На жаль ви програли. Компютер загадав менше число. Але наступного разу вам обовязково пощастить=)")

    elif x <= a <= x:
        print("Ура ви перемогли!")

    else:
        print("На жаль ви програли. Компютер загадав більше число. Але наступного разу вам обовязково пощастить=)")
